# For Development Machines
tap "heroku/brew"
tap "borkdude/brew"
tap "fishtown-analytics/dbt"
tap "heroku/brew"

#
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "ngrok"
cask "vagrant-manager"
cask "vagrant"
cask "virtualbox"

brew "borkdude/brew/babashka"
brew "coreutils"
brew "clojure"
brew "fishtown-analytics/dbt/dbt"
brew "docker-compose"
brew "docker"
brew "gnu-sed"
brew "gpg"
brew "grep"
brew "heroku/brew/heroku"
brew "jq"
brew "leiningen"
brew "npm"
brew "python@3.8"
brew "readline"
brew "rlwrap"
brew "sassc"
brew "terraform"
brew "terragrunt"
