# Shared all
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "zero-sh/tap"

# Tool for managing dock items
brew "dockutil"

# Select default apps for documents and URL schemes on macOS
brew "duti"

# Maintain consistent coding style between multiple editors
brew "editorconfig"

# Distributed revision control system
brew "git"

# Mac App Store command-line interface
brew "mas"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"

# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"

# Reimplementation of ctags(1)
brew "ctags"

# Command-line fuzzy finder written in Go
brew "fzf"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Platform built on V8 to build network applications
brew "node"

brew "awscli"
brew "bash"
brew "bash-completion"
brew "direnv"
brew "hub"
brew "reattach-to-user-namespace"
brew "scmpuff"
brew "the_silver_searcher"
brew "wget"


## NEED
# akiflow
## END NEED

cask "1password" # TODO: this or mas
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "hookshot"
cask "hyperswitch"
cask "raycast"
cask "superhuman"
cask "swish"
brew "tmux"
cask "transmit"
cask "visual-studio-code"
cask "zerotier-one"

# Cask Fonts (https://github.com/Homebrew/homebrew-cask-fonts)

cask "font-anonymous-pro"
cask "font-jetbrains-mono"

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

