# For work "laptops" (non-Dev)
tap "homebrew/cask-drivers"

cask "evernote"
cask "fantastical"
cask "gpg-suite-no-mail"
cask "krisp"
cask "linear-linear"
cask "homebrew/cask-drivers/logitech-options"
cask "microsoft-word"
cask "microsoft-excel"
cask "notion"
cask "setapp"
cask "soundsource"
cask "swish"
cask "thingsmacsandboxhelper"
cask "transmit"
cask "zoom"

mas "Bear", id: 1091189122
mas "Things 3", id: 904280696
